app/controllers/user_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `zones`.* FROM `zones` INNER JOIN `user_watch_zones` ON `zones`.`id` = `user_watch_zones`.`zone_id` WHERE `user_watch_zones`.`user_id` = 1
---
  def show
  	user = User.find(params[:id])
    user.zones.map(&method(:callUpdateProperties))

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `zones` (`created_at`, `postcode`, `updated_at`) VALUES ('2013-12-28 21:36:31', 'WC2', '2013-12-28 21:36:31')
SELECT `zones`.* FROM `zones` WHERE `zones`.`postcode` IS NULL ORDER BY `zones`.`id` ASC LIMIT 1
INSERT INTO `user_watch_zones` (`created_at`, `updated_at`, `user_id`, `zone_id`) VALUES ('2013-12-28 21:36:31', '2013-12-28 21:36:31', 1, 2)
SELECT `user_watch_zones`.* FROM `user_watch_zones` WHERE `user_watch_zones`.`user_id` = 1 AND `user_watch_zones`.`zone_id` = 2 ORDER BY `user_watch_zones`.`id` ASC LIMIT 1
---
  def update

  	user = User.find(params[:id])
  	new_zone = Zone.where( postcode: params[:zone]).first_or_create
    new_zone.processProperties
  	userWatchZone = UserWatchZone.where( user_id: params[:id] , zone_id: new_zone.id ).first_or_create

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 6 LIMIT 1
SELECT `user_watch_zones`.* FROM `user_watch_zones` WHERE `user_watch_zones`.`user_id` = 1 AND `user_watch_zones`.`zone_id` = 6 ORDER BY `user_watch_zones`.`id` ASC LIMIT 1
DELETE FROM `user_watch_zones` WHERE `user_watch_zones`.`id` = 6
DELETE FROM `zones` WHERE `zones`.`id` = 6
---
  def destroy
    user = User.find(params[:id])
    zone = Zone.find(params[:zone])

    userWatchZone = UserWatchZone.where( user_id: user.id , zone_id: zone.id).first

    userWatchZone.destroy