app/controllers/zone_controller.rb

  def show
  	zone = Zone.find(params[:id])
---
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 1 LIMIT 1

  def showProperties
  	zone = Zone.find(params[:id])
---
SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 1 LIMIT 1